Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/MTMA_old/MTMA_old.tmx
Source language: en_us
Languages: de_de

source: CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. A catalytic composition comprising a complex of metal oxides wherein the relative ratios of the listed elements in said catalyst are represented by the following formula:
de_de: 1. Katalytische Zusammensetzung, umfassend einen Komplex von Metalloxiden, wobei die relativen Verhältnisse der aufgeführten Elemente in dem Katalysator durch die folgende Formel dargestellt werden:

source: wherein A is at least one element selected from the group consisting of lithium, sodium, potassium, rubidium and cesium;
de_de: wobei A mindestens ein Element ist, das aus der Gruppe bestehend aus Lithium, Natrium, Kalium, Rubidium und Cäsium ausgewählt ist;

source: D is at least one element selected from the group consisting of nickel, cobalt, manganese, zinc, magnesium, calcium, strontium, cadmium and barium;
de_de: D mindestens ein Element ist, das aus der Gruppe bestehend aus Nickel, Kobalt, Mangan, Zink, Magnesium, Calcium, Strontium, Cadmium und Barium ausgewählt ist;

source: E is at least one element selected from the group consisting of tungsten, boron, aluminum, gallium, indium, phosphorus, arsenic, antimony, vanadium and tellurium;
de_de: E mindestens ein Element ist, das aus der Gruppe bestehend aus Wolfram, Bor, Aluminium, Gallium, Indium, Phosphor, Arsen, Antimon, Vanadium und Tellur ausgewählt ist;

source: F is at least one element selected from the group consisting of lanthanum, europium, gadolinium, terbium, dysprosium, holmium, erbium, thulium, ytterbium, lutetium, scandium, yttrium, titanium, zirconium, hafnium, niobium, tantalum, aluminum, gallium, indium, thallium, silicon, lead and germanium;
de_de: F mindestens ein Element ist, das aus der Gruppe bestehend aus Lanthan, Europium, Gadolinium, Terbium, Dysprosium, Holmium, Erbium, Thulium, Ytterbium, Lutetium, Scandium, Yttrium, Titan, Zirconium, Hafnium, Niob, Tantal, Aluminium, Gallium, Indium, Thallium, Silicium, Blei und Germanium ausgewählt ist;

source: G is at least one element selected from the group consisting of silver, gold, ruthenium, rhodium, palladium, osmium, iridium, platinum and mercury;
de_de: G mindestens ein Element ist, das aus der Gruppe bestehend aus Silber, Gold, Ruthenium, Rhodium, Palladium, Osmium, Iridium, Platin und Quecksilber ausgewählt ist;

source: Q is at least one of samarium, praseodymium and neodymium; and
de_de: Q mindestens eines von Samarium, Praseodym und Neodym ist; und

source: a, b, c, d, e, f, g, h, n, m and x are, respectively, the atomic ratios of bismuth (Bi), iron (Fe), A, D, E, F, G, cerium (Ce), chromium (Cr), molybdenum (Mo) and oxygen (O), relative to “m” atoms of molybdenum (Mo),
de_de: a, b, c, d, e, f, g, h, n, m und x jeweils die Atomverhältnisse von Bismut (Bi), Eisen (Fe), A, D, E, F, G, Cer (Ce), Chrom (Cr), Molybdän (Mo) und Sauerstoff (O), bezogen auf "m" Atome von Molybdän (Mo), sind,

source: wherein a is 0.05 to 7,
de_de: wobei a zwischen 0,05 und 7 ist,

source: b is 0.1 to 7,
de_de: b zwischen 0,1 und 7 ist,

source: c is 0 to 5,
de_de: c 0 bis 5 ist,

source: d is 0.1 to 12,
de_de: d 0,1 bis 12 ist,

source: e is 0 to 5,
de_de: e 0 bis 5 ist,

source: f is 0 to 5,
de_de: f 0 bis 5 ist,

source: g is 0 to 0.2,
de_de: g 0 bis 0,2 ist,

source: h is 0.01 to 5,
de_de: h 0,01 bis 5 ist,

source: m is 10 to15,
de_de: m 10 bis 15 ist,

source: n is 0 to 5,
de_de: n 0 bis 5 ist,

source: q is 0 to 2.476, and
de_de: q 0 und 2,476 ist und

source: x is the number of oxygen atoms required to satisfy the valence requirements of the other component elements present; and
de_de: x die Anzahl von Sauerstoffatomen ist, die erforderlich ist, um die Valenzanforderungen der anderen vorhandenen Komponentenelemente zu erfüllen; und

source: wherein 0.4< b/(a+h) and 0.3 ≤ (a+h)/d; and
de_de: wobei 0,4 < b/(a+h) und 0,3 ≤ (a+h)/d; und

source: wherein 0 ≤ m – (3a+2b+c+2d+3h+3n)/2 ≤ 1.0.
de_de: wobei 0 ≤ m - (3a+2b+c+2d+3h+3n)/2 ≤ 1,0.

source: 2. The catalyst composition of claim 1, wherein 0.3 ≤ (a+h)/d ≤ 1.
de_de: 2. Katalysatorzusammensetzung nach Anspruch 1, wobei 0,3 ≤ (a+h)/d ≤ 1.

source: 3. The catalyst composition of claim 1, wherein 0.45 ≤ (a+h)/d ≤ 1.
de_de: 3. Katalysatorzusammensetzung nach Anspruch 1, wobei 0,45 ≤ (a+h)/d ≤ 1.

source: 4. The catalyst composition of claim 1 wherein D is nickel.
de_de: 4. Katalysatorzusammensetzung nach Anspruch 1, wobei D Nickel ist.

source: 5. The catalyst composition of claim 1, additionally comprising at least one alkali molybdate compound represented by the formula:
de_de: 5. Katalysatorzusammensetzung nach Anspruch 1, zusätzlich umfassend mindestens eine Alkalimolybdatverbindung, dargestellt durch die Formel:

source: wherein A is Rb, Li, Na, K, Cs, or a mixture thereof.
de_de: wobei A Rb, Li, Na, K, Cs oder eine Mischung davon ist.

source: z is from 1 to about 8.
de_de: z von 1 bis etwa 8 ist.

source: 6. The catalyst composition of claim 5, wherein the alkali molybdate compound comprises a support selected from the group consiting of silica, alumina, zirconia, titania, or mixtures therof, and wherein the support comprises between 1 wt% to 99 wt% of the molybdate and support combination.
de_de: 6. Katalysatorzusammensetzung nach Anspruch 5, wobei die Alkalimolybdatverbindung einen Träger umfasst, der aus der Gruppe bestehend aus Siliciumdioxid, Aluminiumoxid, Zirconiumdioxid, Titandioxid oder Mischungen davon ausgewählt ist, und wobei der Träger zwischen 1 Gew.-% bis 99 Gew.-% der Molybdat- und Trägerkombination umfasst.

source: 7. The catalyst composition of claim 5, wherein the catalyst composition comprises between of 0.01 wt% to about 10 wt% of the alkali molybdate compound relative to the total weight of said catalyst composition.
de_de: 7. Katalysatorzusammensetzung nach Anspruch 5, wobei die Katalysatorzusammensetzung zwischen 0,01 Gew.-% bis etwa 10 Gew.-% der Alkalimolybdatverbindung, bezogen auf das Gesamtgewicht der Katalysatorzusammensetzung, umfasst.

source: 8. A process for the conversion of an olefin selected from the group consisting of propylene, isobutylene and mixtures thereof, to acrylonitrile, methacrylonitrile, and mixtures thereof, with hydrogen cyanide produced as a co-product, by reacting in the vapor phase at an elevated temperature and pressure said olefin with a molecular oxygen containing gas and ammonia in the presence of a catalyst wherein the relative ratios of the listed elements in said catalyst are represented by the following formula:
de_de: 8. Verfahren zur Umwandlung eines Olefins, ausgewählt aus der Gruppe, bestehend aus Propylen, Isobutylen und Mischungen davon, in Acrylnitril, Methacrylnitril und Mischungen davon, mit Cyanwasserstoff, hergestellt als ein Co-Produkt, durch Umsetzen des Olefins in der Dampfphase bei erhöhter Temperatur und erhöhtem Druck mit einem molekularen Sauerstoff enthaltenden Gas und Ammoniak in Gegenwart eines Katalysators, wobei die relativen Verhältnisse der aufgelisteten Elemente in dem Katalysator durch die folgende Formel dargestellt werden:

source: Q is at least one of samarium, praseodymium and neodymium and
de_de: Q mindestens eines von Samarium, Praseodym und Neodym ist und

source: m is 10 to 15,
de_de: m 10 bis 15 ist,

source: n is from 0 to 5,
de_de: n 0 bis 5 ist,

source: q is 0 to 2.476 and
de_de: q 0 bis 2,476 ist und

source: 9. The process of claim 8, wherein the yield of hydrogen cyanide is increased relative to the amount of acrylonitrile and methacrylonitrile produced in the process by the addition to the catalyst of at least one alkali molybdate compound represented by the formula:
de_de: 9. Verfahren nach Anspruch 8, wobei die Ausbeute an Cyanwasserstoff im Verhältnis zur Menge an Acrylnitril und Methacrylnitril, die im Verfahren hergestellt wird, durch Zugabe von mindestens einer Alkalimolybdatverbindung der folgenden Formel zum Katalysator erhöht wird:

source: wherein A is Rb, Li, Na, K, Cs, or a mixture thereof, and
de_de: wobei A Rb, Li, Na, K, Cs oder eine Mischung davon ist, und

source: The process of claim 9 wherein the catalyst composition comprises between of 0.01 wt% to about 10 wt% of the alkali molybdate compound relative to the total weight of said catalyst composition.
de_de: Verfahren nach Anspruch 9, wobei die Katalysatorzusammensetzung zwischen 0,01 Gew.-% bis etwa 10 Gew.-% der Alkalimolybdatverbindung, bezogen auf das Gesamtgewicht der Katalysatorzusammensetzung, umfasst.

source: The process of claim 8, wherein the yield of acrylonitrile and methacrylonitrile is increased relative to the amount of hydrogen cyanide produced in the process by the addition to the catalyst of a molybdenum oxide compound selected from the group consisting of MoO3, ammonium molybdate, ammonium heptamolybdate, ammonium dimolybdate and mixtures thereof.
de_de: Verfahren nach Anspruch 8, dadurch gekennzeichnet, dass die Ausbeute an Acrylnitril und Methacrylnitril gegenüber der Menge an Cyanwasserstoff erhöht wird, die bei dem Verfahren durch Zugabe einer Molybdänoxidverbindung, ausgewählt aus der Gruppe bestehend aus MoO3, Ammoniummolybdat, Ammoniumheptamolybdat, Ammoniumdimolybdat und Mischungen davon, zu dem Katalysator hergestellt wird.

source: The process of claim 11, wherein the amount of said molybdenum oxide compound added to the catalyst is in the range of 0.01 wt% to about 10 wt%, relative to the weight of said catalyst.
de_de: Verfahren nach Anspruch 11, wobei die Menge der Molybdänoxidverbindung, die dem Katalysator zugegeben wird, im Bereich von 0,01 Gew.-% bis etwa 10 Gew.-%, bezogen auf das Gewicht des Katalysators, liegt.

source: The process of claim 8, wherein 0.3 ≤ (a+h)/d ≤ 1 in the catalyst.
de_de: Verfahren nach Anspruch 8, wobei 0,3 ≤ (a+h)/d ≤ 1 im Katalysator.

source: The process of claim 8, wherein 0.45 ≤ (a+h)/d ≤ 1 in the catalyst.
de_de: Verfahren nach Anspruch 8, wobei 0,45 ≤ (a+h)/d ≤ 1 im Katalysator.

source: The process of claim 8, wherein said process is defined by the following:
de_de: Verfahren nach Anspruch 8, wobei das Verfahren durch das Folgende definiert ist:

source: wherein %AN is the Acrylonitrile Yield and %AN ≥ 82,
de_de: wobei %AN die Acrylnitrilausbeute ist und %AN ≥ 82,

source: %HCN is the Hydrogen Cyanide Yield and %HCN ≥ 5
de_de: %HCN die Cyanwasserstoffausbeute ist und %HCN ≥ 5,

source: %ACN is the Acetonitrile Yield,
de_de: %ACN die Acetonitrilausbeute ist,

source: %PC is the Propylene Conversion, and
de_de: %PC der Propylenumsatz ist und

source: α is greater than 102.5.
de_de: α ist größer als 102,5.

source: 1. Composition obtained from the pyrolysis of waste rubber including natural rubber and subsequent separation of the resulting oil, which has:
de_de: 1. Zusammensetzung, die durch Pyrolyse von Gummiabfall, einschließlich Naturkautschuk, und anschließende Abtrennung des dabei entstehenden Öls erlangt wird, mit folgenden Eigenschaften:

source: a flash point of at least 40°C but no higher than 55°C determined according to ASTM D93 procedure B,
de_de: ein Flammpunkt von mindestens 40 °C, jedoch nicht mehr als 55 °C, bestimmt gemäß dem ASTM D93 Verfahren B,

source: a boiling point range starting at 100°C or higher under atmospheric pressure determined according to ASTM D86,
de_de: ein Siedebereich, der bei 100 °C oder höher unter atmosphärischem Druck beginnt, bestimmt gemäß ASTM D86,

source: a density at 15°C of less than 990 kg/m3 determined according to ASTM D4052,
de_de: eine Dichte bei 15 °C von weniger als 990 kg/m3, bestimmt gemäß ASTM D4052,

source: a total acid number (TAN) of up to 12 determined according to ASTM D664,
de_de: eine Gesamtsäurezahl (TAN) von bis zu 12, bestimmt gemäß ASTM D664,

source: a styrene content of less than 7000ppm determined according to gas chromatography, and an organic halogen, as Cl, content of less than 50 mg/kg determined according to IP510, and
de_de: einen Styrolgehalt von weniger als 7.000 ppm, bestimmt gemäß Gaschromatographie, und ein organisches Halogen, wie Cl, mit einem Gehalt von weniger als 50 mg/kg, bestimmt gemäß IP510, und

source: which contains biogenic carbon in an amount of at least 15%, as determined according to ASTM D6866 Method B(AMS), and aromatic hydrocarbons with a total aromatic hydrocarbon content of at least 20%m/m. as measured according to IP391.
de_de: das biogenen Kohlenstoff in einer Menge von mindestens 15 %, bestimmt gemäß ASTM D6866 Verfahren B(AMS), und aromatische Kohlenwasserstoffe mit einem Gesamtgehalt an aromatischen Kohlenwasserstoffen von mindestens 20 % m/m, gemessen gemäß IP391, enthält.

source: 2. Composition according to claim 1, which has a flash point of at least 40°C, preferably at least 45°C, but less than 55°C, and more preferably which has a flash point ranging from 40°C, preferably 45°C, to 54°C, and most preferably from 40°C preferably 45°C, to 53°C.
de_de: 2. Zusammensetzung nach Anspruch 1, die einen Flammpunkt von mindestens 40 °C, vorzugsweise mindestens 45 °C, aber weniger als 55 °C aufweist, und noch bevorzugter einen Flammpunkt im Bereich von 40 °C, vorzugsweise 45 °C, bis 54 °C, und am meisten bevorzugt von 40 °C, vorzugsweise 45 °C, bis 53 °C aufweist.

source: 3. Composition according to claim 1 or 2 having a biogenic carbon content of at least 20%, preferably at least 30%, and more preferably at least 40%, as determined according to ASTM D6866 Method B (AMS).
de_de: 3. Zusammensetzung nach Anspruch 1 oder 2 mit einem biogenen Kohlenstoffgehalt von mindestens 20 %, vorzugsweise mindestens 30 % und noch bevorzugter mindestens 40 %, bestimmt gemäß ASTM D6866 Verfahren B (AMS).

source: 4. Composition according to any preceding claim having a total aromatic hydrocarbon content of at least 35%m/m and preferably at least 50%m/m, as measured according to IP391.
de_de: 4. Zusammensetzung nach einem der vorhergehenden Ansprüche mit einem Gesamtgehalt an aromatischen Kohlenwasserstoffen von mindestens 35 % m/m und vorzugsweise mindestens 50 % m/m, gemessen gemäß IP391.

source: 5. Composition according to any preceding claim, having a boiling point range starting at 110°C or higher, preferably 120°C or higher, more preferably 130°C or higher and most preferably 140°C or higher.
de_de: 5. Zusammensetzung nach einem der vorhergehenden Ansprüche mit einem Siedepunktbereich, der bei 110 °C oder höher, vorzugsweise bei 120 °C oder höher, noch bevorzugter bei 130 °C oder höher und am meisten bevorzugt bei 140 °C oder höher beginnt.

source: 6. Composition according to any preceding claim, having a boiling point range starting no higher than 220°C, preferably no higher than 210°C, more preferably no higher than 200°C and most preferably no higher than 190°C.
de_de: 6. Zusammensetzung nach einem der vorhergehenden Ansprüche, mit einem Siedebereich, der nicht höher als 220 °C, vorzugsweise nicht höher als 210 °C, noch bevorzugter nicht höher als 200 °C und am meisten bevorzugt nicht höher als 190 °C beginnt.

source: 7. Composition according to any preceding claim, having a flash point ranging from 40°C, preferably 45°C, to less than 55°C, preferably ranging from 40°C, preferably 45°C, to 54°C, and more preferably ranging from 40°C, preferably 45°C, to 53°C.
de_de: 7. Zusammensetzung nach einem der vorhergehenden Ansprüche mit einem Flammpunkt im Bereich von 40 °C, vorzugsweise 45 °C, bis weniger als 55 °C, vorzugsweise im Bereich von 40 °C, vorzugsweise 45 °C, bis 54 °C und noch bevorzugter im Bereich von 40 °C, vorzugsweise 45 °C, bis 53 °C.

source: 8. Composition according to any preceding claim, wherein the waste rubber from which the composition is derived comprises waste tyres.
de_de: 8. Zusammensetzung nach einem der vorhergehenden Ansprüche, wobei der Gummiabfall, aus dem die Zusammensetzung gewonnen wird, Altreifen umfasst.

source: 9. Marine fuel, preferably a residual marine fuel, comprising from 0.1 to 10% of a composition as defined in any preceding claim.
de_de: 9. Schiffskraftstoff, vorzugsweise ein Restschiffskraftstoff, umfassend von 0,1 bis 10 % einer Zusammensetzung, wie nach einem der vorhergehenden Ansprüche definiert.

source: Use of a composition as defined in any of claims 1 to 8 as a component in a fuel product, preferably as a marine fuel component and more preferably as a component in a residual marine fuel.
de_de: Verwendung einer Zusammensetzung nach einem der Ansprüche 1 bis 8 als Bestandteil eines Kraftstoffprodukts, vorzugsweise als Bestandteil eines Schiffskraftstoffs und noch bevorzugter als Bestandteil eines Restschiffskraftstoffs.

source: Process for extracting fuel products from waste rubber, comprising the steps of:
de_de: Verfahren zur Gewinnung von Kraftstoffprodukten aus Gummiabfall, umfassend die folgenden Schritte:

source: (a) subjecting waste rubber including natural rubber to pyrolysis to produce a pyrolysis vapour, wherein the waste rubber preferably contains at least 10wt%, more preferably at least 20wt% and most preferably at least 30wt% of natural rubber;
de_de: (a) Unterziehen von Gummiabfall, einschließlich Naturkautschuk, einer Pyrolyse, um einen Pyrolysedampf zu produzieren, wobei der Gummiabfall vorzugsweise mindestens 10 Gew.-%, noch bevorzugter mindestens 20 Gew.-% und am meisten bevorzugt mindestens 30 Gew.-% Naturkautschuk enthält;

source: (b) subjecting the pyrolysis vapour to a condensation step to produce a pyrolytic oil having a boiling point range of 45-400°C and a flash point below 25°C, preferably below 18°C;
de_de: (b) Unterziehen des Pyrolysedampfes einem Kondensationsschritt, um ein Pyrolyseöl mit einem Siedebereich von 45 bis 400 °C und einem Flammpunkt unter 25 °C, vorzugsweise unter 18 °C, zu produzieren;

source: (c) passing the pyrolytic oil through a centrifuge to reduce the solids level to below 1.5 wt%, preferably below 0.5 wt%, and then subjecting the resultant stream to a further solids removal step to reduce the solids level to no more than 0.5wt%, preferably no more than 0.2wt%, then subjecting the pyrolytic oil to a vacuum steam stripping step at a pressure of less than 0.85 bar a and with a temperature of less than 120°C at the top of the column, and recovering a first component having an initial boiling point not exceeding 75°C under atmospheric pressure and a second component which has a boiling point range starting from 100°C under atmospheric pressure or higher and which possesses the properties defined in any of claims 1 to 7.
de_de: (c) Durchleiten des pyrolytischen Öls durch eine Zentrifuge, um den Feststoffgehalt auf unter 1,5 Gew.-%, vorzugsweise unter 0,5 Gew.-%, zu reduzieren, und dann Unterziehen des resultierenden Stroms einem weiteren Schritt zur Entfernung von Feststoffen, um den Feststoffgehalt auf nicht mehr als 0,5 Gew.-%, vorzugsweise nicht mehr als 0,2 Gew.-%, zu reduzieren, dann Unterziehen des pyrolytischen Öls einem Vakuum-Dampfabstreifschritt bei einem Druck von weniger als 0,85 bar und einer Temperatur von weniger als 120 °C an dem Kopf der Säule, und Gewinnen einer ersten Komponente mit einem Anfangssiedepunkt von nicht mehr als 75 °C unter Atmosphärendruck und einer zweiten Komponente, die einen Siedebereich ab 100 °C unter Atmosphärendruck oder höher aufweist und die Eigenschaften besitzt, die in einem der Ansprüche 1 bis 7 definiert sind.

source: Process according to claim 11, wherein said first and second components together comprise at least 98vol%, preferably at least 99vol% of the total product obtained from this vacuum steam stripping step (c).
de_de: Verfahren nach Anspruch 11, wobei die erste und zweite Komponente zusammen mindestens 98 Vol.-%, vorzugsweise mindestens 99 Vol.-% des Gesamtprodukts umfassen, das aus diesem Vakuum-Dampfabstreifschritt (c) erlangt wird.

source: 1. A RMM, Remote Monitoring and Management, system operatively associated with monitoring and managing a plurality of devices, including ransomware detection, the RMM system comprising:
de_de: 1. RMM(Remote Monitoring and Management)-System, das operativ mit Überwachen und Verwalten einer Vielzahl von Vorrichtungen, einschließlich Ransomware-Detektion, verbunden ist, das RMM-System umfassend:

source: a RMM agent module locally installed on each device and operatively communicating with an OS, operating system, installed on each device;
de_de: ein RMM-Agentenmodul, das auf jeder Vorrichtung lokal installiert ist und operativ mit einem auf jeder Vorrichtung installierten Betriebssystem (OS) kommuniziert;

source: a cloud-based RMM platform hosted by a cloud-based infrastructure service and operatively communicating with each device RMM agent module, the cloud-based RMM Platform configured to monitor and manage each of the plurality of devices; and
de_de: eine cloudbasierte RMM-Plattform, die von einem cloudbasierten Infrastrukturdienst gehostet ist und operativ mit dem RMM-Agentenmodul jeder Vorrichtung kommuniziert, wobei die cloudbasierte RMM-Plattform konfiguriert ist, jede der Vielzahl von Vorrichtungen zu überwachen und zu verwalten; und

source: a RD, Ransomware Detection, module locally installed on each device and operatively communicating with each respective device RMM agent module, the RD module configured to perform a method of detecting a ransomware-encryption in a plurality of files received by the device, the method including:
de_de: ein RD(Ransomware-Detektions)-Modul, das auf jeder Vorrichtung lokal installiert ist und operativ mit dem jeweiligen RMM-Agentenmodul jeder Vorrichtung kommuniziert, wobei das RD-Modul konfiguriert ist, ein Verfahren eines Detektierens einer Ransomware-Verschlüsselung in einer Vielzahl von von der Vorrichtung empfangenen Dateien durchzuführen, wobei das Verfahren Folgendes beinhaltet:

source: a) receiving from the cloud-based RMM platform ransomware monitor configuration data, the ransomware monitor configuration data including one or more watch-items including a list of one or more files, drives, and volumes to monitor for ransomware detection;
de_de: a) Empfangen von Ransomware-Überwachungskonfigurationsdaten von der cloudbasierten RMM-Plattform, wobei die Ransomware-Überwachungskonfigurationsdaten ein oder mehrere Wächterelemente beinhalten, einschließlich einer Liste von einer oder mehreren Dateien, Laufwerken und Datenträgern, um auf Ransomware-Detektion zu überwachen;

source: b) initiating a filewatcher and filewatcher handler to monitor and receive callbacks for create, delete, update, and rename file-events associated with the watch-items, the filewatcher adding each create, delete, update and rename file-event to a metadata watch-item file-event queue, the metadata watch-item file-event queue including raw watch-item file-event data associated with each create, delete, update, and rename file-event associated with the watch-items received from the cloud-based RMM platform, the raw-data including one or more of fileobjects and parent folders identified in the watch-item file-event;
de_de: b) Initiieren eines Dateiwächters und eines Dateiwächter-Handlers, um Rückrufe zu überwachen und zu empfangen für Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignisse, die mit den Wächterelementen verbunden sind, wobei der Dateiwächter jedes Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignis einer Metadaten-Wächterelement-Dateiereignis-Warteschlange hinzufügt, wobei die Metadaten-Wächterelement-Dateiereignis-Warteschlange Wächterelement-Dateiereignisrohdaten beinhaltet, die mit jedem mit den von der cloudbasierten RMM-Plattform empfangenen Wächterelementen verbundenen Erstell-, Lösch-, Aktualisierungs- und Umbenennungs-Dateiereignis verbunden sind, wobei die Rohdaten eines oder mehrere von Dateiobjekten und übergeordneten Ordnern beinhalten, die in dem Wächterelement-Dateiereignis identifiziert sind;
